In [1]:
import pandas as pd

In [15]:
df = pd.read_csv('Product-Level Total Sales and Metrics.csv')
df

           date  item_id  total_sales  total_units_ordered
0    2025-06-01        0       309.99                    1
1    2025-06-01        3       338.00                    2
2    2025-06-01        4       617.99                    3
3    2025-06-01        9       219.00                    1
4    2025-06-01       12       534.00                    3
..          ...      ...          ...                  ...
697  2025-06-14      150       959.90                   10
698  2025-06-14      154       492.00                    4
699  2025-06-14      161      1170.00                   18
700  2025-06-14      254         0.00                    0
701  2025-06-14      266       436.00                    2

[702 rows x 4 columns]

In [16]:
df.head()

         date  item_id  total_sales  total_units_ordered
0  2025-06-01        0       309.99                    1
1  2025-06-01        3       338.00                    2
2  2025-06-01        4       617.99                    3
3  2025-06-01        9       219.00                    1
4  2025-06-01       12       534.00                    3

In [17]:
df.isnull().sum()

date                   0
item_id                0
total_sales            0
total_units_ordered    0
dtype: int64

In [18]:
# Normalize column names: lowercase, underscores, remove special chars
df.columns = df.columns.str.lower().str.replace(' ', '_').str.replace('[^a-z0-9_]', '', regex=True)

In [19]:
# Show all duplicate rows (excluding the first occurrence by default)
duplicates = df[df.duplicated()]
print(duplicates)

Empty DataFrame
Columns: [date, item_id, total_sales, total_units_ordered]
Index: []

In [21]:
df.to_csv('totalsalesandmarket.csv', index=False)